# RebarInternalMultiplanarDuplicate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInternalMultiplanarDuplicate Property
ParameterTypeId Class See Also
---
"INTERNAL: Multiplanar Duplicate"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInternalMultiplanarDuplicate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInternalMultiplanarDuplicate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInternalMultiplanarDuplicate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace